brew "noti" # utility to display notifications from scripts
brew "trash" # rm, but put in the trash rather than completely delete

# Applications
cask "kitty" # a better terminal emulator
cask "imageoptim" # a tool to optimize images
cask "alacritty"
cask "wezterm"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-3270-nerd-font"
brw "font-hack-nerd-font"

# packages
brew "java"
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "git-delta" # a better git diff
brew "entr" # file watcher / command runner
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "gnu-sed"
brew "neovim" # A better vim
brew "python" # python (latest)
brew "ripgrep" # very fast file searcher
brew "nvm" # Fast Node version manager
brew "shellcheck" # diagnostics for shell scripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zsh" # zsh (latest)
brew "thefuck"
brew "pyenv"
brew "pyenv-virtualenv"
brew "eza"
brew "glow"
brew "zstd"
brew "k9s"
brew "kind"
brew "kubectx"
brew "helm"
brew "pygments"
brew "cowsay"
brew "lolcat"
brew "zoxide"
brew "zsh-syntax-highlighting"
