# Bundle
tap "homebrew/bundle"

# Packages
brew "bat"
brew "python@3.12"
brew "cloc"
brew "cowsay"
brew "entr"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "helm"
brew "highlight"
brew "htop"
brew "jq"
brew "k9s"
brew "kind"
brew "kubectx"
brew "lf"
brew "zstd"
brew "lolcat"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "node"
brew "noti"
brew "nvm"
brew "openjdk"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "ripgrep"
brew "shellcheck"
brew "thefuck"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "lazygit"
brew "lazydocker"
brew "awscli"
brew "atuin"
brew "ffmpegthumbnailer"
brew "unar"
brew "poppler"
brew "yazi"
brew "xh"
brew "kondo"
brew "rnr"
brew "mprocs"
brew "golang"
brew "direnv"
brew "ast-grep"


# fonts
brew "font-3270-nerd-font"
brew "font-fira-code-nerd-font"
brew "font-roboto-mono-nerd-font"
brew "font-symbols-only-nerd-font"
brew "font-cascadia-code"


cask "xcodes"

# GCP sdk
cask "google-cloud-sdk"

# Terminals
cask "kitty"
cask "wezterm"
cask "alacritty"

# Utils
cask "imageoptim" # a tool to optimize images

# Fonts
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

